<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2016/12/31
 * Time: 20:32
 */

return [
        //乙方合同状态
    'ContractType'   =>Array(
        '0'=>'甲方',
        '1'=>'乙方'
    ),
    'IsAssitNeed'   =>Array(
        '0'=>'否',
        '1'=>'是'
    ),
    'ContractUpdateInfoState'=>Array(
        '0'=>'待完成',
        '1'=>'解决中',
        '2'=>'已完成'
    ),
    //甲方合同状态
    'PartyAState'   =>Array(    
        '0'=>'选定乙方',
        '1'=>'已提交BPM申请',
        '2'=>'已完成BPM审批',
        '3'=>'已完成合同评审',
        '4'=>'已提交合同系统',
        '5'=>'已完成合同系统审批',
        '6'=>'已完成乙方签署盖章',
        '7'=>'已完成甲方签署盖章',
        '8'=>'已完成验收',
        '9'=>'已收到发票',
        '10'=>'已发起付款流程',
        '11'=>'已完成付款流程审批',
        '12'=>'已付款',
        '13'=>'已报销'
    ),
    //乙方合同状态
    'PartyBState'   =>Array(
        '0'=>'未报价',
        '1'=>'已报价',
        '2'=>'已确定金额',
        '3'=>'已完成合同系统审批',
        '4'=>'已完成乙方签署盖章',
        '5'=>'已完成甲方签署盖章',
        '6'=>'已办理免税',
        '7'=>'已发起开票流程',
        '8'=>'已完成开票流程审批',
        '9'=>'已开发票',
        '10'=>'甲方已付款',
        '11'=>'财务已到款'
    )




];